In [24]:
import pandas as pd
import numpy as np

# From dict of ndarrays / lists

In [25]:
d={'one':[1.,2.,3.,4.],'two':[4.,3.,2.,1.]}

In [26]:
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [27]:
pd.DataFrame(d,index=['a','b','c','d'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [28]:
np.zeros(2)

array([0., 0.])

In [29]:
data=np.zeros(2, dtype=[('A', 'i4'), ('B', 'f4'), ('C', 'a10')])

In [30]:
data[:]=[(1,2.,'hello'),(2,3.,'world')]

In [31]:
data

array([(1, 2., b'hello'), (2, 3., b'world')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [32]:
pd.DataFrame(data)

   A    B         C
0  1  2.0  b'hello'
1  2  3.0  b'world'

In [33]:
pd.DataFrame(data,index=['first','second'])

        A    B         C
first   1  2.0  b'hello'
second  2  3.0  b'world'

In [34]:
pd.DataFrame(data,columns=['C','A','B'])

          C  A    B
0  b'hello'  1  2.0
1  b'world'  2  3.0

In [35]:
x=np.array([1,2,3])

In [36]:
x[x>1]

array([2, 3])

# From a list of dicts

In [37]:
data2=[{'a':1,'b':2},{'a':5,'b':10,'c':20}]

In [38]:
data2

[{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]

In [39]:
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [40]:
data3=[{'a':[1,2,3],'b':[4,5,6]},{'a':[0,0,0],'b':[1,1,1]}]

In [41]:
pd.DataFrame(data3)

           a          b
0  [1, 2, 3]  [4, 5, 6]
1  [0, 0, 0]  [1, 1, 1]

In [42]:
pd.DataFrame(data2,index=['first','second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [43]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
   ....:               ('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
   ....:               ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
   ....:               ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
   ....:               ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

In [45]:
date=pd.date_range('20130101',periods=6)

In [47]:
date

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [49]:
df=pd.DataFrame(np.random.randn(6,4))

In [50]:
df

          0         1         2         3
0 -1.412174 -0.402954  0.201990 -0.465031
1 -0.152592 -0.956440  0.733848  0.603029
2  0.602524 -0.128496  1.473358 -0.374056
3  1.081222 -1.230654  0.621767  1.076324
4 -0.389809  1.264828  1.058212  1.203994
5 -1.192941  0.234498 -0.969205  0.037222

In [52]:
pd.DataFrame(np.random.randn(6,4),index=date,columns=['A','B','C','D'])

                   A         B         C         D
2013-01-01 -1.921541 -1.287075  0.803225  0.089983
2013-01-02 -0.426717  0.464995  0.717254  0.593951
2013-01-03  1.470749 -0.934088  0.373732 -0.741531
2013-01-04 -0.455715 -1.456295 -1.394191  0.282539
2013-01-05 -0.170389  1.664136 -1.460776  1.266107
2013-01-06 -0.051719 -1.494838 -1.197684  0.037972

In [53]:
pd.Timestamp('20130101')

Timestamp('2013-01-01 00:00:00')

In [72]:
df2=pd.DataFrame({'A':1,
                  'B':pd.Timestamp('20130102'),
                  'C':pd.Series(1,index=list(range(4)),dtype='float64'),
                  'D':np.array([3]*4,dtype='int64'),
                  'E':pd.Series([1,'train','test','train']),
                  'F':'too'
                 },index=list(range(1,5)))

In [73]:
df2

   A          B    C  D      E    F
1  1 2013-01-02  1.0  3  train  too
2  1 2013-01-02  1.0  3   test  too
3  1 2013-01-02  1.0  3  train  too
4  1 2013-01-02  NaN  3    NaN  too

In [74]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float64
D             int64
E            object
F            object
dtype: object

In [75]:
df2.E

1    train
2     test
3    train
4      NaN
Name: E, dtype: object